Revit 2027 API
UnitTypeId.Celsius Property
 Celsius.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Celsius { get; }
Public Shared ReadOnly Property Celsius As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Celsius {
	ForgeTypeId^ get ();
}
static member Celsius : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace